Repository: Pherresa/TFG
Catalog: VisualOS-1.0.5/po/*.po
Languages: cs, es, fr, it

source: current time: %d
cs: aktuální èas: %d
es: tiempo actual: %d
fr: temps: %d
it: Tempo corrente: %d

source: Detach the drawing style to its own window
cs: Odpoj kreslící styl do vlastního okna
es: Extraer el "estilo de dibujo" a su propia ventana
it: Stacca lo stile di disegno dalla sua finestra

source: Select a file
cs: Vyberte soubor
es: Selecionar un archivo
fr: Sélectionner un fichier
it: Seleziona un file

source: MESG
es: MENSA
fr: Message
it: MESS

source: IO
cs: Vstup/Výstup
es: E/S
fr: Entrées/Sorties

source: CLOCK
cs: Hodiny
es: RELOJ
fr: Horloge

source: REQUESTOR
cs: Extra po¾adavy
es: SOLICITANTE
fr: Requêtes manuelles
it: RICHIEDENTE

source: unknown
cs: neznámý
es: desconocido
fr: inconnu
it: sconosciuto

source: Number of queues:
cs: Poèet front:
es: Número de solicitudes:
fr: Nombre de files d'attente:
it: Numero di code:

source: HeartBeat:
cs: Frekvence:
es: Frecuencia:
fr: Battements
it: Battiti del cuore

source: To CPU
cs: Na CPU
es: A la CPU
fr: Vers processeur
it: Alla CPU

source: To Queue %d
cs: Do fronty %d
es: A la cola %d
fr: Vers file %d
it: Alla coda %d

source: Time Slice
cs: Èasový interval
es: Cuanto
fr: Quantum de temps
it: Fetta di tempo

source: Process %d was terminated by %s
cs: %s ukonèil proces %d
es: El proceso %d fue terminado por %s
fr: Le processus %d a été tué par %s
it: Il processo %d è stato terminato da %s

source: time:
cs: èas:
es: tiempo:
fr: temps:
it: tempo:

source: burst:
cs: shluk:
es: ráfaga:
fr: rafale:

source: time: %d
cs: èas: %d
es: tiempo: %d
fr: temps: %d
it: tempo: %d

source: burst: %d
cs: shluk: %d
es: ráfaga: %d
fr: rafale: %d
it: raffica: %d

source: No algorithm properties available
cs: ®ádné vlastnosti algoritmu nejsou k dispozici
es: El algoritmo no tiene propiedades

source: process %d moved to queue %d
cs: proces %d pøesunut do fronty %d
es: el proceso %d saltó a la cola %d
fr: Le processus %d a été mis dans la file %d.
it: processo %d spostato alla coda %d

source: process %d is now running
cs: proces %d nyní bì¾í
es: el proceso %d se está ejecutando
fr: Le processus %d est maintenant bloqué.
it: il processo %d sta andando

source: process %d is now blocked
cs: proces %d je pozastaven
es: el proceso %d esta bloqueado
fr: Le processus %d est maintenant bloqué
it: il processo %d è bloccato

source: process %d is now ready
cs: proces %d je pøipraven
es: el proceso %d esta listo
fr: Le processus %d est maintenant prêt.
it: il processo %d è pronto

source: Welcome to %s version %s
es: Bienvenido a %s versión %s

source: Bars
cs: Pruhy
es: Barras
fr: Graphes
it: Barre

source: Queues
cs: Fronty
es: Colas
fr: Files
it: Code

source: Overlapped Bars
cs: Pøekrývané pruhy
es: Barras Superpuestas
fr: Graphes superposés
it: Barre sovrapposte

source: State
cs: Stav
es: Estado
fr: État
it: Stato

source: I/O
cs: V/V
es: E/S
fr: E/S

source: Memory
cs: Pamì»
es: Memoria
fr: Mémoire
it: Memoria

source: Advanced
cs: Pokroèilé
es: Avanzadas
fr: Détails
it: Avanzate

source: WRITE
cs: zápis
es: Escritura
fr: Écriture
it: SCRITTURA

source: READ
cs: ètení
es: Lectura
fr: Lecture
it: LETTURA

source: select blocks
cs: vybané bloky
es: selecciona bloques
fr: choisir des blocs
it: seleziona blocchi

source: %d (track %d)
cs: %d (stopa %d)
es: %d (pista %d)
fr: %d (cylindre %d)
it: %d (traccia %d)

source: no more accesses
cs: ¾ádné dal¹í pøístupy
es: no hay más accesos
fr: file des accès vide
it: nessun'altro accesso

source: Step:
cs: Krok:
es: Salto:
fr: Pas:
it: Passo:

source: Block %d (Track %d) was requested
cs: je po¾adován blok %d (stopa %d)
es: Bloque %d (Pista %d) fue solicitado
fr: Bloc %d (cylindre %d) demandé.
it: E' stato richiesto il blocco %d (Traccia %d)

source: Read block %d (Track %d)
cs: Èti blok %d (stopa %d)
es: Se ha leido el bloque %d (Pista %d)
fr: Bloc %d (cylindre %d) lu.
it: Legge blocco %d (Traccia %d)

source: No properties available
cs: Zádné vlastnosti algoritmu nejsou k dispozici
es: No hay propiedades disponibles

source: route
cs: trasa
es: Ruta
fr: Instantané
it: strada

source: round
cs: povrch
es: Redondo
fr: Trace
it: rotondo

source: Track: %d
cs: Stopa: %d
es: Pista: %d
fr: Cylindre: %d
it: Traccia: %d

source: We are short on memory, please select a frame to use
cs: Nedostatek pamìti, vyberte který rámec pou¾ít
es: Andamos cortos de memoria, por favor elige un marco para su uso
fr: La mémoire manque, choisir une case à utiliser.
it: Siamo a corto di memoria, selezionare un frame da utilizzare

source: No pending page faults
cs: ®ádné dal¹í výpadky stránek
es: No hay fallos de página pendientes
fr: Plus de défauts de page.
it: Non ci sono errori di pagina pendenti

source: Process %d pagefaulted on page %d
cs: Proces %d mìl výpadek na stránce %d
es: El proceso %d ha producido un fallo en la página %d
fr: Le processus %d a déclenché un défaut de page sur la page %d
it: Il processo %d ha generato un errore sulla pagina %d

source: (WRITE)
cs: (ZÁPIS)
es: (Escritura)
fr: (Écriture)
it: (SCRITURA)

source: (READ)
cs: (ÈTENÍ)
es: (Lectura)
fr: (Lecture)
it: (LETTURA)

source: Process %d accessed page %d
cs: Proces %d pou¾il stránku %d
es: El proceso %d accedió a la página %d
fr: Le processus %d a accédé à la page %d
it: Il processo %d ha acceduto alla pagina %d

source: Process %d got page %d (frame %d)
cs: Proces %d dostal stránku %d (rámec %d)
es: El proceso %d obtuvo la página %d (marco %d)
fr: Le processus %d a reçu la page %d (case %d)
it: Il processo %d ha avuto la pagina %d (frame %d)

source: Process %d lost frame %d (page %d)
cs: Proces %d ztratil rámec %d (stránku %d)
es: El proceso %d perdió el marco %d (página %d)
fr: Le processus %d a perdu la case %d (page %d)
it: Il processo %d ha perso il frame %d (pagina %d)

source: Physical
cs: Fyzická
es: Física
fr: Physique
it: Fisico

source: frame:%d
cs: rámec:%d
es: marco:%d
fr: case:%d

source: page:-
cs: stránka:-
es: Página:-
it: pagina:-

source: page:%d
cs: stránka:%d
es: página:%d
it: pagina:%d

source: frame:000
cs: rámec:000
es: marco:000
fr: case:000

source: frame: -
cs: rámec: -
es: marco: -
fr: case: -

source: frame:%-2d
cs: rámec:%-2d
es: marco:%-2d
fr: case:%-2d

source: frame: 00
cs: rámec: 00
es: marco: 00
fr: case: 00

source: got block %d
cs: získán blok %d
es: se obtuvo el bloque %d
fr: Bloc %d reçu.
it: Si è ottenuto il blocco %d

source: got page %d from process %d
cs: získána stránka %d od procesu %d
es: se obtuvo la página %d del proceso %d
fr: Page %d reçue du processus %d.
it: Ottenuta pagina %d dal processo %d

source: Properties Auto Fill Parameters
cs: Vlastnosti auto-generování
es: Propiedades Parámetros de Autorellenado
it: Proprietà Auto Riempimento Parametri

source: average number of blocks
cs: prùmìrný poèet blokù
es: número medio de bloques
fr: Nombre moyen de blocs
it: numero medio di blocchi

source: The average number of blocks
cs: prùmìrný poèet blokù
es: El número medio de bloques
fr: Le nombre moyen de blocs.
it: Il numero medio di blocchi

source: average time betwen IO accesses
cs: prùmìrný èas mezi V/V operací
es: tiempo medio entre accesos E/S
fr: Durée moyenne entre deux E/S
it: tempo medio tra accessi IO

source: The average time between IO accesses
cs: prùmìrný èas mezi V/V operací
es: El tiempo medio entre accesos de Entrada/Salida
fr: La durée moyenne entre deux Entrées/Sorties.
it: Il tempo medio tra accessi IO

source: average time between process creation
cs: prùmìrný èas mezi vytvoøením procesù
es: tiempo medio entre creación de procesos
fr: Durée moyenne entre deux créations de processus
it: tempo medio tra la creazione di processi

source: The average time between process creation
cs: prùmìrný èas mezi vytvoøením procesù
es: El tiempo medio entre creación de procesos
fr: La durée moyenne entre deux créations de processus.
it: Il tempo medio tra la creazione di processi

source: average number of IO accesses
cs: prùmìrný poèet V/V operací
es: número medio de accesos E/S
fr: Nombre moyen d'E/S
it: numero medio di accessi IO

source: OK
es: Aceptar

source: Process Properties
cs: Vastnosti procesu
es: Propiedades del proceso
fr: Comportement du processus à créer
it: Proprietà processo

source: local time:
cs: lokální èas:
es: tiempo local
fr: Temps local
it: tempo locale:

source: time
cs: èas
es: tiempo
fr: Temps
it: tempo

source: start time
cs: èas spu¹tìní
es: momento de inicio
fr: Temps de début
it: tempo inizio

source: live time
cs: èas bìhu
es: tiempo de vida
fr: Temps de fin
it: tempo vita

source: Add
cs: Pøidat
es: Añadir
fr: Ajouter
it: Aggiungi

source: Replace
cs: Nahradit
es: Remplazar
fr: Remplacer
it: sostituisci

source: Remove
cs: Odebrat
es: Eliminar
fr: Supprimer
it: Elimina

source: Block
cs: Blok
es: Bloque
fr: Bloc
it: Blocco

source: Time
cs: Èas
es: Tiempo
fr: Temps
it: Tempo

source: List of accesses to memory
cs: Seznam pøístupù do pamìti
es: Lista de accesos a memoria
fr: Liste des accès mémoire
it: Lista di accessi alla memoria

source: Page
cs: Stránka
es: Página
it: Pagina

source: Type
cs: Typ
es: Tipo
it: Tipo

source: Reading
cs: Ètení
es: Leyendo
fr: Lecture
it: Leggendo

source: This graph represents the probability of reading from each page
cs: Tento graf reprezentuje pravdìpodobnost ètení pro ka¾dou stránky
es: Esta gráfica representa la probabilidad de leer cada una de las páginas

source: Writing
cs: Zápis
es: Escribiendo
fr: Écriture
it: Scrivendo

source: This graph represents the probability of writing to each page
cs: Tento graf reprezentuje pravdìpodobnost zápisu pro ka¾dou stránku
es: Esta gráfica representa la probabilidad de escribir en cada una de las páginas

source: Total number of pages the process will acces for reading or writing in its whole life
cs: Celkové mno¾ství stránek, které proces pou¾ije pro ètìní nebo zípis za celý svùj ¾ivot
es: Número total de páginas a las que el proceso accederá para leer o escribir a lo largo de toda su vida

source: Total number of pages
cs: Celkový poèet stránek
es: Número total de páginas
fr: Nombre total de page
it: Numero totale di pagine

source: Load
cs: Nahrát
es: Cargar
fr: Charger depuis fichier
it: Carica

source: Auto Fill
cs: Vyplnit automaticky
es: Auto rellenado
fr: Remplissage auto
it: Auto Riempimento

source: Save
cs: Ulo¾it
es: Guardar
fr: Sauver dans fichier
it: salva

source: Parameters
cs: Parametry
es: Parametros
fr: Paramètres
it: Parametri

source: Cancel
cs: Zru¹it
es: Cancelar
fr: Annuler
it: Annulla

source: Statistics
cs: Statistiky
es: Estadisticas
fr: Statistiques
it: Statistiche

source: creation:
cs: vyvoøení:
es: creación:
fr: création:
it: creazione:

source: average time between process creation
cs: prùmìrný èas mezi vytvoøením procesù
es: tiempo medio entre creación de procesos
fr: durée moyenne entre deux créations de processus
it: tempo medio tra la ceazione dei processi

source: average process burst length
cs: prùmerná délka shluku
es: longitud media de la ráfaga
fr: durée moyenne d'un processus
it: lunghezza media della raffica

source: return:
cs: návrat:
es: retorno:
it: ritorno:

source: average time from process creation to process destruction
cs: prùmìrný èas od vytvoøení procesu do jeho zruøení
es: tiempo medio entre la creación del proceso y su terminación
fr: durée moyenne entre une création et une destruction de processus
it: tempo medio dalla creazione alla distruzione del processo

source: response:
cs: respuesta:
es: respuesta:
fr: réponse:
it: responso:

source: _New
cs: _Nový
es: _Nuevo
fr: _Nouveau
it: _Nuovo

source: _Memory
cs: _Pamì»
es: _Memoria
fr: _Mémoire
it: _Memoria

source: _Disk
es: _Disco
fr: _Disque
it: _Disco

source: _Requestor
cs: _Extra po¾adavky
es: _Solicitante
fr: _Requêtes
it: _Richiedente

source: _Clock
cs: _Hodiny
es: _Reloj
fr: _Horloges

source: Don't show the process editor when creating a new process, simply autofill it
cs: Nezobrazuj editor procesù pøi vytváøení nového procesu, vygeneruj automaticky
es: No mostrar el editor al crear un nuevo proceso, simplemente auto-rellenarlo
fr: Ne pas afficher la boîte de dialogue de création des processus. Les paramètres des processus seront choisis aléatoirement.
it: Non visualizzare l'editor dei processi alla creazione di un nuovo processo, semplicemente riempilo

source: Auto _Fill Processes
cs: Automatické _Generování Procesù
es: Auto _Rellenar Procesos
fr: _Paramétrage automatique des processus
it: Auto _Riempimento Processi

source: Stop the main Clock any time a process changes its state/queue
cs: Zastav hodiny kdykoliv proces zmìní stav nebo frontu
es: Detener el Reloj principal cada vez que un proceso cambie su estado/cola
fr: Arrêter l'horloge dès qu'un processus change d'état/de file d'attente
it: Ferma il clock principale ogni volta che un processo cambia il stato/coda

source: Stop _Clock
cs: Zastav _Hodiny
es: Detener el _Reloj
fr: _Arrêt automatique de l'horloge
it: Ferma _Clock

source: Lets you choose the statistic parameters used by autofill function
cs: Vyber statistické parametry pro automatické generování procesù
es: Permite elegir los parámetros estadísticos utilizados por la función de auto- rellenado
fr: Permet de choisir les statistiques des paramètres générés aléatoirement.
it: Lascia scegliere i parametri della statistica usata dalla funzione auto riempimento

source: AutoFill _Parameters
cs: _Parametry pro generování
es: Auto-rellenar _Parámetros
fr: _Statistiques du paramétrage automatique
it: _Parametri Autoriempimento

source: New File
cs: Nový soubor
es: Archivo Nuevo
fr: Nouveau fichier
it: File Nuovo

source: New
cs: Nový
es: Nuevo
fr: Nouveau
it: Nuovo

source: Edit
cs: Editovat
es: Editar
fr: Édition
it: Modifica

source: Properties
cs: Vlastnosti
es: Propiedades
fr: Propriétés
it: Proprietà

source: Open File
cs: Otevøít soubor
es: Abrir Archivo
fr: Ouvrir fichier
it: Apri File

source: Open
cs: Otevøít
es: Abrir
fr: Ouvrir
it: Apri

source: Save File
cs: Ulo¾it soubor
es: Guardar Archivo
fr: Sauver fichier
it: Salva File

source: Reset
cs: Restartovat
es: Reiniciar
fr: Réinitialisation
it: Azzera

source: Process
cs: Proces
es: Proceso
fr: Processus
it: Processo

source: Algorithm
cs: Algoritmus
es: Algoritmo
fr: Algorithme
it: Algoritmo

source: Stop the main Clock when anything interesting happens
cs: Zastavit hodiny kdyz se stane cokoliv dùle¾itého
es: Detener el reloj principal cuando ocurra algo interesante
fr: Arrêt de l'horloge au premier événement intéressant.
it: Ferma il clock quando succede qualcosa d'interessante

source: _Disable Subsystem
cs: _Vypni subsystém
es: _Desactivar subsistema
fr: _Désactiver le sous-système
it: _disabilita sottosistema

source: Let the clock work on its own.
cs: Spustit hodiny.
es: Dejar que el reloj funcione solo.
fr: Démarrage de l'horloge.
it: Lascia lavorare da solo il clock.

source: Start
es: Inicio
fr: Marche
it: Inizio

source: Stop the clock, we can still go with "Single Ticks"
cs: Zastavit hodiny, je mo¾né poøád pou¾ít krokování
es: Detener el reloj, aún podremos incrementar las unidades de tiempo de una en una
fr: Arrêt de l'horloge. Il est toujours possible d'avancer pas à pas.
it: Ferma il clock, si può procedere con "uno alla volta"

source: Stop
es: Detener
fr: Arrêt
it: Ferma

source: Single Tick
cs: Jeden tik
es: Una Unidad
fr: Pas à pas
it: Uno alla volta

source: Time Unit (ms)
cs: Jednotka èasu (ms)
es: Unidad de Tiempo (ms)
fr: Vitesse d'horloge (ms)
it: Unità di tempo (ms)

source: This is the length of a single time unit in miliseconds. When this number is high, time goes slowly and viceversa.
cs: Délka jednoho tiku v milisekundách. Kdy¾ je tohle èíslo velké, èas jde pomalu a naopak.
es: Esta es la longitud de cada unidad de tiempo en milisegundos, cuando este número es elevado el tiempo pasa despacio y al revés

source: Requested Blocks
cs: Po¾adované bloky
es: Bloques Solicitados
fr: Blocs demandés
it: Blocchi richiesti

source: To Read Blocks
cs: Bloky k naètení
es: Bloques Pendientes
fr: Blocs à lire
it: Leggere blocchi

source: The average number of blocks the process will access in total.
cs: Prùmìrné mno¾ství blokù, které bude proces celkem potøebovat.
es: El número medio de bloques a los que el proceso accederá en total.
fr: Nombre moyen de blocs que le processus va accéder au total.
it: Il numero medio di blocchi a cui il processo accederà in totale.

source: The average time between IO accesses.
cs: Prùmìrný èas mezi V/V operacemi
es: El tiempo medio entre accesos de Entrada/Salida
fr: Durée moyenne entre deux E/S.
it: Il tempo medio fra gli accessi IO.

source: The average time between process creation.
cs: Prùmìrný èas mezi vytváøením procesù
es: El tiempo medio entre la creación de procesos
fr: Durée moyenne entre deux créations de processus.
it: Il tempo medio fra la creazione di processi.

source: Default Memory Usage
cs: Implicitní vyu¾ití pamìti
es: Uso de Memoria por Defecto
fr: Utilisation de la mémoire par défaut
it: Uso standard di memoria

source: Process Auto Filling
cs: Auto Generování procesù
es: Auto Rellenado de Procesos
fr: Paramétrage auto de processus
it: Auto riempimento processi

source: The maximun width for incremental styles. Don't expect good performance with a high value.
cs: Maximální ¹íøka pro inkrementální styl. Neoèekávejte skvìlý výkon pro vysoká èísla
es: El ancho máximo de un "estilo" incremental. No espere buen rendimiento con un valor alto.
fr: Une valeur trop grande diminurait la rapidité d'affichage.
it: La larghezza massima per gli stili incrementali. Non aspettarsi buone performance con valori alti.

source: Max Graph History
cs: Maximální historie grafu
es: Máximo Histórico de una Gráfica
fr: Taille de l'historique dans les graphes
it: Massimo storico di un grafico

source: Pixmap Size Steps
cs: Krok velikosti pixmapy
es: Niveles tamaño imagen
it: Grandezza passi

source: Who Knows What
cs: Kdo Ví Co
es: Quién sabe qué
it: Suggerimenti

source: Drawing Styles
cs: Kreslící styl
es: Estilos de Dibujo
fr: Affichage
it: Stili di disegno

source: Use Random Blocks
cs: Pou¾ij náhodné bloky
es: Utilizar Bloques Aleatorios
fr: Utiliser des blocs aléatoires
it: Usa blocchi random

source: Access
cs: Pøístup
es: Acceder
fr: Accès
it: Accesso

source: Read
cs: Ètení
es: Leer
fr: Lire
it: Lettura

source: Write
cs: Zápis
es: Escribir
fr: Écrire
it: Scrittura

source: Copyright (C) 2000 Manuel Estrada Sainz <ranty@debian.org>
es: Copyright (C) 2000,2004 Manuel Estrada Sainz <ranty@debian.org>

source: Visual Simulator of an Operating System.
cs: Vizuální simulátor operaèního systému.
es: Simulador Visual de Sistema Operativo
fr: Simulateur visuel d'un sytème d'exploitation.
it: Simulatore Visuale di un Sistema Operativo.

source: MEM
cs: Pamì»
fr: Mémoire

source: Manual
cs: Manuál
fr: Manuel
it: Manuale

source: General
cs: Obecné
fr: Général
it: Generale

source: Virtual
cs: Virtuální
fr: Virtuelle
it: Virtuale

source: CPU
fr: Processeur

source: pid:
fr: processus:

source: pid: %d
fr: processus: %d

source: original
it: originale
